app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @list = []
    @posts.sort_by do |p|
    pp "X" * 50
    pp p.votes.length
---
SELECT "posts".* FROM "posts"
SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = $1  [["post_id", 15]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = $1  [["post_id", 15]]

  def create
    @post = Post.create( title: params[:title],
               username: params[:username])
---
INSERT INTO "posts" ("title", "username", "comment_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fdfd"], ["username", "sigmund"], ["comment_count", 822], ["created_at", "2015-05-31 01:37:10.773989"], ["updated_at", "2015-05-31 01:37:10.773989"]]

  def vote_for
    @post = Post.find(params[:id])
    @post.votes.create(value: 1)
    @post.save

    { vote_counter: @post.votes.count}.to_json
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 83]]
INSERT INTO "votes" ("value", "post_id") VALUES ($1, $2) RETURNING "id"  [["value", 1], ["post_id", 83]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = $1  [["post_id", 83]]